Catalogs/Образец.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>Образец</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Картинки</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ОписаниеКартинка</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Картинка</Name>
							<Type>
								<v8:Type>v8:ValueStorage</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Материалы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Единица</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ЕдиницыИзмеренияНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

InformationRegisters/НастройкиПроекта.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>НастройкиПроекта</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Значение</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
						<v8:Type>xs:string</v8:Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:TypeSet>cfg:AnyIBRef</v8:TypeSet>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ИмяНастройки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НомерНастройки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Catalogs/Образец/Ext/ManagerModule.bsl
Функция ПолучитьДанныеОбразца(Образец) Экспорт
	
	ДанныеОбразца = Новый Структура("Материалы, Наименование, Обработка, Код, ШК", Новый Массив);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Образец.Наименование КАК Наименование,
		|	Образец.Обработка КАК Обработка,
		|	Образец.Код КАК Код
		|ИЗ
		|	Справочник.Образец КАК Образец
		|ГДЕ
		|	Образец.Ссылка = &Образец
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ОбразецМатериалы.Количество КАК Количество,
		|	ОбразецМатериалы.Примечание КАК Примечание,
		|	ОбразецМатериалы.Номенклатура.Представление КАК Номенклатура,
		|	ОбразецМатериалы.Единица.Представление КАК Единица
		|ИЗ
		|	Справочник.Образец.Материалы КАК ОбразецМатериалы
		|ГДЕ
		|	ОбразецМатериалы.Ссылка = &Образец";
	
	Запрос.УстановитьПараметр("Образец", Образец);
	
	РезультатЗапроса = Запрос.ВыполнитьПакет();
	
	Выборка = РезультатЗапроса[0].Выбрать();
	Пока Выборка.Следующий() Цикл
		ЗаполнитьЗначенияСвойств(ДанныеОбразца, Выборка);
		ДанныеОбразца.ШК = омШрихкодыНаСереверКлиенте.ПолучитьПрефиксШтрихкодаПоТипу(Образец) + Формат(Выборка.Код, "ЧЦ=9; ЧВН=; ЧГ=0");
		
		ДанныеОбразца.Наименование = СтрЗаменить(ДанныеОбразца.Наименование, Символы.ВК, "");
		ДанныеОбразца.Наименование = СтрЗаменить(ДанныеОбразца.Наименование, Символы.ПС, "");
		ДанныеОбразца.Наименование = "Образец № " + Формат(ДанныеОбразца.Код ,"ЧГ=0") + " " + ДанныеОбразца.Наименование;
		
		ДанныеОбразца.Обработка = СтрЗаменить(ДанныеОбразца.Обработка, Символы.ВК, ""); 
		ДанныеОбразца.Обработка = СтрЗаменить(ДанныеОбразца.Обработка, Символы.ПС, "");
		
	КонецЦикла;
	
	Выборка = РезультатЗапроса[1].Выбрать();
	Пока Выборка.Следующий() Цикл
		
		СтруктураДаныеМатериала = Новый Структура("Номенклатура, Единица, Примечание, Количество", );
		ЗаполнитьЗначенияСвойств(СтруктураДаныеМатериала, Выборка);
		ДанныеОбразца.Материалы.Добавить(СтруктураДаныеМатериала);
		
	КонецЦикла;
	
    Возврат ДанныеОбразца;
КонецФункции // ПолучитьДанныеОбразца()

Функция ПолучитьСтркутуруНастроекПечати() Экспорт

	СтруктураНастроекПечати = Новый Структура();
	
	СтруктураНастроекПечати.Вставить("РазмерШрифтаНаименования", 	12);
	СтруктураНастроекПечати.Вставить("ПолужирныйНаименование", 		Истина);
	СтруктураНастроекПечати.Вставить("", );
	СтруктураНастроекПечати.Вставить("", );
	СтруктураНастроекПечати.Вставить("", );
	СтруктураНастроекПечати.Вставить("", );
	СтруктураНастроекПечати.Вставить("", );
	СтруктураНастроекПечати.Вставить("", );
	СтруктураНастроекПечати.Вставить("", );
	
	
	Возврат СтруктураНастроекПечати;

КонецФункции // ПолучитьСтркутураНстроекПечати()


Функция ПолучитьВариантыНастроек() Экспорт

	СтруктураНастроекПечати = Новый Структура();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	НастройкиПроекта.Значение КАК НаименованиеВарианта,
		|	НастройкиПроекта.НомерНастройки КАК НомерНастройки
		|ИЗ
		|	РегистрСведений.НастройкиПроекта КАК НастройкиПроекта
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.НастройкиПроекта КАК НастройкиПроектаВарианты
		|		ПО НастройкиПроекта.НомерНастройки = НастройкиПроектаВарианты.НомерНастройки
		|ГДЕ
		|	И НастройкиПроекта.ИмяНастройки = ""ВариантыНастроекПечатиОбразцов""
		|	И НастройкиПроектаВарианты.ИмяНастройки В(&МассивНастроекПечатьОбразца)";
	
	Запрос.УстановитьПараметр("МассивНастроекПечатьОбразца", ПолучитьМассивНастроекПечатьОбразца());
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		// Вставить обработку выборки ВыборкаДетальныеЗаписи
	КонецЦикла;
	
	
	Возврат СтруктураНастроекПечати;

КонецФункции // ПолучитьСтркутураНстроекПечати() 

Функция ПолучитьМассивНастроекПечатьОбразца()

	

КонецФункции // ПолучитьМассивНастроекПечатьОбразца()


Функция СформироватьТаблицуНаСервере(Образец, СтркутураНстроекПечати, ДанныеОбразца = Неопределено) Экспорт
	
	Если ДанныеОбразца = Неопределено Тогда
		ДанныеОбразца = ПолучитьДанныеОбразца(Образец);	
	КонецЕсли;
	
	Пример.Очистить();
 	СтруктрураОбъеденненыхЯчеек = Новый Структура("Наименование, Обработка, Материалы, МаксимальнаяШирина", 2, 2, 2, 5);

	мШиринаКолонок = Новый Массив(?(Метериалы, 5, 2));
	мШиринаКолонок[0] = 1;
	мШиринаКолонок[1] = 20;
	
	Если Метериалы Тогда
		мШиринаКолонок[2] = 6;
		мШиринаКолонок[3] = 6;
		мШиринаКолонок[4] = 30;
	КонецЕсли;
	
	стПараметровОбласти = омТабличныйДокументКлиентСервер.ПолучитьСтруктуруПараметров(Истина);
	стПараметровОбласти.НомерСтроки 			= 2;
	стПараметровОбласти.НомерКолонки 			= 2;
	стПараметровОбласти.ДлинаОбласти 			= СтруктрураОбъеденненыхЯчеек.Наименование;
	стПараметровОбласти.ВысотаОбласти 			= 1;
	стПараметровОбласти.РазмерШрифта 			= СтруктураНастроекПечати.РазмерШрифтаНаименования; 
	стПараметровОбласти.Полужирный     			= СтруктураНастроекПечати.ПолужирныйНаименование; 
	стПараметровОбласти.ГоризонтальноеПоложение = ГоризонтальноеПоложение.Лево;
	стПараметровОбласти.РазмещениеТекста 		= ТипРазмещенияТекстаТабличногоДокумента.Переносить;
	
	Если Наименование Тогда
		Пример.Вывести(ПолучитьТаблицуНаименовнаия(ДанныеОбразца, СтруктрураОбъеденненыхЯчеек, стПараметровОбласти, мШиринаКолонок));
	КонецЕсли;
	
	Если ВыводитьШК Тогда
		Пример.Вывести(ПолучитьШК(ДанныеОбразца, СтруктрураОбъеденненыхЯчеек, стПараметровОбласти));
	КонецЕсли;
	
	Если Обработка Тогда
		стПараметровОбласти.РазмерШрифта 		= РазмерШрифтаОбработка; 
		стПараметровОбласти.Полужирный     		= ПолужирныйОбработка; 
		Пример.Вывести(ПолучитьТаблицуОбработка(ДанныеОбразца, СтруктрураОбъеденненыхЯчеек, стПараметровОбласти, мШиринаКолонок));
	КонецЕсли;
	
	Если Метериалы Тогда
		стПараметровОбласти.РазмерШрифта 		= РазмерШрифтаМатериалы; 
		стПараметровОбласти.Полужирный     		= ПолужирныйМатериалы;
		стПараметровОбласти.РазмещениеТекста	= ТипРазмещенияТекстаТабличногоДокумента.Обрезать;
		Пример.Вывести(ПолучитьТаблицуМатериалы(ДанныеОбразца, СтруктрураОбъеденненыхЯчеек, стПараметровОбласти, мШиринаКолонок));
	КонецЕсли;
	
	Если ВыводитьРамку Тогда
		омТабличныйДокументКлиентСервер.ОбвестиОбласть(Пример);	
	КонецЕсли;
	
Конецфункции

Функция ПолучитьТаблицуМатериалы(ДанныеОбразца, СтруктрураОбъеденненыхЯчеек, стПараметровОбласти, мШиринаКолонок)

	ТабДок = Новый ТабличныйДокумент;
	Если ДанныеОбразца.Материалы.Количество() = 0 Тогда
	    Возврат ТабДок;
	КонецЕсли;
	
	ЛинияГраницы = Новый Линия(ТипЛинииЯчейкиТабличногоДокумента.Сплошная, 1); 
	стПараметровОбласти.ГраницаСлева			= ЛинияГраницы;
	стПараметровОбласти.ГраницаСправа			= ЛинияГраницы;
	стПараметровОбласти.ГраницаСверху			= ЛинияГраницы;
	стПараметровОбласти.ГраницаСнизу			= ЛинияГраницы;
	стПараметровОбласти.ЦветРамки				= "000000000";
	стПараметровОбласти.ДлинаОбласти 			= 1;		
	
	Для х = 0 По ДанныеОбразца.Материалы.Количество() - 1 Цикл
		
		ДанныеСтроки = ДанныеОбразца.Материалы[х];
		
		стПараметровОбласти.НомерКолонки = 2;
		стПараметровОбласти.Текст 		= ДанныеСтроки.Номенклатура;
		омТабличныйДокументКлиентСервер.СформироватьОбластьТабличногоДокумента(ТабДок, стПараметровОбласти);	
		стПараметровОбласти.НомерКолонки = 3;
		стПараметровОбласти.Текст 		= ДанныеСтроки.Количество;
		омТабличныйДокументКлиентСервер.СформироватьОбластьТабличногоДокумента(ТабДок, стПараметровОбласти);	
		стПараметровОбласти.НомерКолонки = 4;
		стПараметровОбласти.Текст 		= ДанныеСтроки.Единица;
		омТабличныйДокументКлиентСервер.СформироватьОбластьТабличногоДокумента(ТабДок, стПараметровОбласти);	
		стПараметровОбласти.НомерКолонки = 5;
		стПараметровОбласти.Текст 		= ДанныеСтроки.Примечание;
		омТабличныйДокументКлиентСервер.СформироватьОбластьТабличногоДокумента(ТабДок, стПараметровОбласти);	
		
		стПараметровОбласти.НомерСтроки = стПараметровОбласти.НомерСтроки + 1;
		
	КонецЦикла;
	
	Возврат ТабДок;

КонецФункции // ПолучитьТаблицуНаименовнаия()

Функция ПолучитьТаблицуОбработка(ДанныеОбразца, СтруктрураОбъеденненыхЯчеек, стПараметровОбласти, мШиринаКолонок)

	ПоискРазмера = Истина;
	РазмерНайден = Ложь;
	ПоследнийРаз = Ложь;
	
	Пока ПоискРазмера Цикл
		
		Если ПоследнийРаз Тогда
			ПоискРазмера = Ложь;
		КонецЕсли;
		
		ТабДок = Новый ТабличныйДокумент;
		омТабличныйДокументКлиентСервер.УстановитьШиринуКолонок(ТабДок, мШиринаКолонок);
		Область = омТабличныйДокументКлиентСервер.СформироватьОбластьТабличногоДокумента(ТабДок, стПараметровОбласти);	
		ВысотаПустойОбласти = ВысотаОбластиВмм(Область, ТабДок);
		Область.Текст 		= ДанныеОбразца.Обработка;
		
		Если ПоискРазмера Тогда
			
			ВысотаСТекстом = ВысотаОбластиВмм(Область, ТабДок);
			
			Если ВысотаПустойОбласти < ВысотаСТекстом Тогда
				СтруктрураОбъеденненыхЯчеек.Обработка = СтруктрураОбъеденненыхЯчеек.Обработка + 1;
				Если СтруктрураОбъеденненыхЯчеек.Обработка > СтруктрураОбъеденненыхЯчеек.МаксимальнаяШирина Тогда
					Прервать;	
				КонецЕсли;

				Если РазмерНайден Тогда
					ПоследнийРаз = Истина;
				КонецЕсли;
				
			Иначе
				Если СтруктрураОбъеденненыхЯчеек.Обработка = 1 Тогда
					Прервать;	
				КонецЕсли;
				РазмерНайден = Истина;
				СтруктрураОбъеденненыхЯчеек.Обработка = СтруктрураОбъеденненыхЯчеек.Обработка - 1;
			КонецЕсли;
			
			стПараметровОбласти.ДлинаОбласти = СтруктрураОбъеденненыхЯчеек.Обработка;
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат ТабДок;
	
КонецФункции // ПолучитьТаблицуНаименовнаия()

Функция ПолучитьШК(ДанныеОбразца, СтруктрураОбъеденненыхЯчеек, стПараметровОбласти)
	
	КоличествоМиллиметровВПикселе = омТабличныйДокументСерверПовтор.ПолучитьКоличествоМиллиметровВПикселе();
	ТабДок = Новый ТабличныйДокумент;
	
	РисунокШтрихкода = ТабДок.Рисунки.Добавить(ТипРисункаТабличногоДокумента.Картинка); 
	РисунокШтрихкода.ВыводитьНаПечать 		= Истина;
	РисунокШтрихкода.Высота					= РазмерШКпоВысоте / КоличествоМиллиметровВПикселе;
	РисунокШтрихкода.Ширина					= РазмерШКпоШирине / КоличествоМиллиметровВПикселе; 
	
	
	ПараметрыШтрихкода = ГенерацияШтрихкода.ПараметрыГенерацииШтрихкода();
	ПараметрыШтрихкода.Ширина 				= Окр(РисунокШтрихкода.Ширина * 3);
	ПараметрыШтрихкода.Высота 				= Окр(РисунокШтрихкода.Высота * 3);
    ПараметрыШтрихкода.Штрихкод				= ДанныеОбразца.ШК;
	ПараметрыШтрихкода.ТипКода 				= 4;
	ПараметрыШтрихкода.РазмерШрифта 		= 14;
	ПараметрыШтрихкода.СохранятьПропорции 	= Истина;
	ПараметрыШтрихкода.ОтображатьТекст 		= ТекстНаШтрихКоде;
    
    РисунокШтрихкода.Картинка 		= 	ГенерацияШтрихкода.ИзображениеШтрихкода(ПараметрыШтрихкода).Картинка;
    РисунокШтрихкода.РазмерКартинки = РазмерКартинки.Пропорционально;
	РисунокШтрихкода.ГраницаСверху  = Ложь;
	РисунокШтрихкода.ГраницаСлева  	= Ложь;
	РисунокШтрихкода.ГраницаСнизу  	= Ложь;
	РисунокШтрихкода.ГраницаСправа  = Ложь;
	
	Возврат ТабДок;

КонецФункции // ПолучитьШК()

Функция ПолучитьТаблицуНаименовнаия(ДанныеОбразца, СтруктрураОбъеденненыхЯчеек, стПараметровОбласти, мШиринаКолонок)
	
	ПоискРазмера = Истина;
	РазмерНайден = Ложь;
	ПоследнийРаз = Ложь;
	
	Пока ПоискРазмера Цикл
		
		Если ПоследнийРаз Тогда
			ПоискРазмера = Ложь;
		КонецЕсли;
		
		ТабДок = Новый ТабличныйДокумент;
		омТабличныйДокументКлиентСервер.УстановитьШиринуКолонок(ТабДок, мШиринаКолонок);
		Область = омТабличныйДокументКлиентСервер.СформироватьОбластьТабличногоДокумента(ТабДок, стПараметровОбласти);	
		ВысотаПустойОбласти = ВысотаОбластиВмм(Область, ТабДок);
		Область.Текст 		= ТекстНаименование;
		
		Если НЕ ПоследнийРаз Тогда
			
			ВысотаСТекстом = ВысотаОбластиВмм(Область, ТабДок);
			
			Если ВысотаПустойОбласти < ВысотаСТекстом Тогда
				СтруктрураОбъеденненыхЯчеек.Наименование = СтруктрураОбъеденненыхЯчеек.Наименование + 1;
				Если СтруктрураОбъеденненыхЯчеек.Наименование > СтруктрураОбъеденненыхЯчеек.МаксимальнаяШирина Тогда
					Прервать;	
				КонецЕсли;
				Если РазмерНайден Тогда
					ПоследнийРаз = Истина;
				КонецЕсли;
			Иначе
				Если СтруктрураОбъеденненыхЯчеек.Наименование = 1 Тогда
					Прервать;	
				КонецЕсли;
				РазмерНайден = Истина;
				СтруктрураОбъеденненыхЯчеек.Наименование = СтруктрураОбъеденненыхЯчеек.Наименование - 1;
			КонецЕсли;
			
			стПараметровОбласти.ДлинаОбласти = СтруктрураОбъеденненыхЯчеек.Наименование;
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат ТабДок;

КонецФункции // ПолучитьТаблицуНаименовнаия()


Функция ВысотаОбластиВмм(пОбласть, пТабДок)
    
    Надпись = пТабДок.Рисунки.Добавить(ТипРисункаТабличногоДокумента.Текст);    
    Надпись.Расположить(пОбласть);    
    Высота = Надпись.Высота;    
    пТабДок.Рисунки.Удалить(Надпись);
    
    Возврат(Высота);
    
КонецФункции
